Revit 2027 API
ScheduleDefinition.GetField(Int32) Method
 Gets a field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleField GetField(
	int index
)
Public Function GetField (
	index As Integer
) As ScheduleField
public:
ScheduleField^ GetField(
	int index
)
member GetField :
        index : int -> ScheduleField
Parameters
index Int32
 The index of the field.
Return Value
ScheduleField
 The field.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  index is not a valid field index in this ScheduleDefinition.
See Also
Reference
ScheduleDefinition Class
GetField Overload
Autodesk.Revit.DB Namespace